Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz1064dal169.h
extern volatile __CEVERbits_t CEVERbits __asm__ ("CEVER") __attribute__((section("sfrs"), address(0xBF8E5000)));
#define CECON CECON
extern volatile uint32_t   CECON __attribute__((section("sfrs"), address(0xBF8E5004)));
typedef struct {
  uint32_t DMAEN:1;
  uint32_t BDPPLEN:1;
  uint32_t BDPCHST:1;
  uint32_t :2;
  uint32_t SWAPEN:1;
  uint32_t SWRST:1;
  uint32_t SWAPOEN:1;
} __CECONbits_t;
extern volatile __CECONbits_t CECONbits __asm__ ("CECON") __attribute__((section("sfrs"), address(0xBF8E5004)));
#define CEBDADDR CEBDADDR
extern volatile uint32_t   CEBDADDR __attribute__((section("sfrs"), address(0xBF8E5008)));
typedef struct {
  uint32_t BDPADDR:32;
} __CEBDADDRbits_t;
extern volatile __CEBDADDRbits_t CEBDADDRbits __asm__ ("CEBDADDR") __attribute__((section("sfrs"), address(0xBF8E5008)));
#define CEBDPADDR CEBDPADDR
extern volatile uint32_t   CEBDPADDR __attribute__((section("sfrs"), address(0xBF8E500C)));
typedef struct {
  uint32_t BASEADDR:32;
} __CEBDPADDRbits_t;
extern volatile __CEBDPADDRbits_t CEBDPADDRbits __asm__ ("CEBDPADDR") __attribute__((section("sfrs"), address(0xBF8E500C)));
#define CESTAT CESTAT
extern volatile uint32_t   CESTAT __attribute__((section("sfrs"), address(0xBF8E5010)));
typedef struct {
  uint32_t BDCTRL:16;
  uint32_t ACTIVE:1;
  uint32_t START:1;
  uint32_t BDSTATE:4;
  uint32_t :2;
  uint32_t ERRPHASE:2;
  uint32_t ERROP:3;
  uint32_t ERRMODE:3;
} __CESTATbits_t;
extern volatile __CESTATbits_t CESTATbits __asm__ ("CESTAT") __attribute__((section("sfrs"), address(0xBF8E5010)));
#define CEINTSRC CEINTSRC
extern volatile uint32_t   CEINTSRC __attribute__((section("sfrs"), address(0xBF8E5014)));
typedef struct {
  uint32_t PENDIF:1;
  uint32_t CBDIF:1;
  uint32_t PKTIF:1;
  uint32_t AREIF:1;
} __CEINTSRCbits_t;
extern volatile __CEINTSRCbits_t CEINTSRCbits __asm__ ("CEINTSRC") __attribute__((section("sfrs"), address(0xBF8E5014)));
#define CEINTEN CEINTEN
extern volatile uint32_t   CEINTEN __attribute__((section("sfrs"), address(0xBF8E5018)));
typedef struct {
  uint32_t PENDIE:1;
  uint32_t CBDIE:1;
  uint32_t PKTIE:1;
  uint32_t AREIE:1;
} __CEINTENbits_t;
extern volatile __CEINTENbits_t CEINTENbits __asm__ ("CEINTEN") __attribute__((section("sfrs"), address(0xBF8E5018)));
#define CEPOLLCON CEPOLLCON
extern volatile uint32_t   CEPOLLCON __attribute__((section("sfrs"), address(0xBF8E501C)));
typedef struct {
  uint32_t BDPPLCON:16;
} __CEPOLLCONbits_t;
extern volatile __CEPOLLCONbits_t CEPOLLCONbits __asm__ ("CEPOLLCON") __attribute__((section("sfrs"), address(0xBF8E501C)));
#define CEHDLEN CEHDLEN
extern volatile uint32_t   CEHDLEN __attribute__((section("sfrs"), address(0xBF8E5020)));
typedef struct {
  uint32_t HDRLEN:8;
} __CEHDLENbits_t;
extern volatile __CEHDLENbits_t CEHDLENbits __asm__ ("CEHDLEN") __attribute__((section("sfrs"), address(0xBF8E5020)));
#define CETRLLEN CETRLLEN
extern volatile uint32_t   CETRLLEN __attribute__((section("sfrs"), address(0xBF8E5024)));
typedef struct {
  uint32_t TRLRLEN:8;
} __CETRLLENbits_t;
extern volatile __CETRLLENbits_t CETRLLENbits __asm__ ("CETRLLEN") __attribute__((section("sfrs"), address(0xBF8E5024)));
#define RNGVER RNGVER
extern volatile uint32_t   RNGVER __attribute__((section("sfrs"), address(0xBF8E6000)));
typedef struct {
  uint32_t REVISION:7;
  uint32_t VERSION:9;
  uint32_t ID:16;
} __RNGVERbits_t;
extern volatile __RNGVERbits_t RNGVERbits __asm__ ("RNGVER") __attribute__((section("sfrs"), address(0xBF8E6000)));
#define RNGCON RNGCON
extern volatile uint32_t   RNGCON __attribute__((section("sfrs"), address(0xBF8E6004)));
typedef struct {
  uint32_t PLEN:8;
  uint32_t TRNGEN:1;
  uint32_t PRNGEN:1;
  uint32_t CONT:1;
  uint32_t TRNGMODE:1;
  uint32_t LOAD:1;
} __RNGCONbits_t;
extern volatile __RNGCONbits_t RNGCONbits __asm__ ("RNGCON") __attribute__((section("sfrs"), address(0xBF8E6004)));
#define RNGPOLY1 RNGPOLY1
extern volatile uint32_t   RNGPOLY1 __attribute__((section("sfrs"), address(0xBF8E6008)));
typedef struct {
  uint32_t POLY:32;
} __RNGPOLY1bits_t;
extern volatile __RNGPOLY1bits_t RNGPOLY1bits __asm__ ("RNGPOLY1") __attribute__((section("sfrs"), address(0xBF8E6008)));
#define RNGPOLY2 RNGPOLY2
extern volatile uint32_t   RNGPOLY2 __attribute__((section("sfrs"), address(0xBF8E600C)));
typedef struct {
  uint32_t POLY:32;
} __RNGPOLY2bits_t;
extern volatile __RNGPOLY2bits_t RNGPOLY2bits __asm__ ("RNGPOLY2") __attribute__((section("sfrs"), address(0xBF8E600C)));
#define RNGNUMGEN1 RNGNUMGEN1
extern volatile uint32_t   RNGNUMGEN1 __attribute__((section("sfrs"), address(0xBF8E6010)));
typedef struct {
  uint32_t RNG:32;
} __RNGNUMGEN1bits_t;
extern volatile __RNGNUMGEN1bits_t RNGNUMGEN1bits __asm__ ("RNGNUMGEN1") __attribute__((section("sfrs"), address(0xBF8E6010)));
#define RNGNUMGEN2 RNGNUMGEN2
extern volatile uint32_t   RNGNUMGEN2 __attribute__((section("sfrs"), address(0xBF8E6014)));
typedef struct {
  uint32_t RNG:32;
} __RNGNUMGEN2bits_t;
extern volatile __RNGNUMGEN2bits_t RNGNUMGEN2bits __asm__ ("RNGNUMGEN2") __attribute__((section("sfrs"), address(0xBF8E6014)));
#define RNGSEED1 RNGSEED1
extern volatile uint32_t   RNGSEED1 __attribute__((section("sfrs"), address(0xBF8E6018)));
typedef struct {
  uint32_t SEED:32;
} __RNGSEED1bits_t;
extern volatile __RNGSEED1bits_t RNGSEED1bits __asm__ ("RNGSEED1") __attribute__((section("sfrs"), address(0xBF8E6018)));
#define RNGSEED2 RNGSEED2
extern volatile uint32_t   RNGSEED2 __attribute__((section("sfrs"), address(0xBF8E601C)));
typedef struct {
  uint32_t SEED:32;
} __RNGSEED2bits_t;
extern volatile __RNGSEED2bits_t RNGSEED2bits __asm__ ("RNGSEED2") __attribute__((section("sfrs"), address(0xBF8E601C)));
#define RNGCNT RNGCNT
extern volatile uint32_t   RNGCNT __attribute__((section("sfrs"), address(0xBF8E6020)));
typedef struct {
  uint32_t RCNT:7;
} __RNGCNTbits_t;
extern volatile __RNGCNTbits_t RNGCNTbits __asm__ ("RNGCNT") __attribute__((section("sfrs"), address(0xBF8E6020)));
#define GLCDMODE GLCDMODE
extern volatile uint32_t   GLCDMODE __attribute__((section("sfrs"), address(0xBF8EA000)));
typedef struct {
  uint32_t :5;
  uint32_t RGBSEQ:3;
  uint32_t FORMATCLK:1;
  uint32_t YUVOUTPUT:1;
  uint32_t :9;
  uint32_t FORCEBLANK:1;
  uint32_t PGRAMPEN:1;
  uint32_t :1;
  uint32_t PCLKPOL:1;
  uint32_t VSYNCCYC:1;
  uint32_t DITHER:1;
  uint32_t :1;
  uint32_t DEPOL:1;
  uint32_t HSYNCPOL:1;
  uint32_t VSYNCPOL:1;
  uint32_t :1;
  uint32_t CURSOREN:1;
  uint32_t LCDEN:1;
} __GLCDMODEbits_t;
extern volatile __GLCDMODEbits_t GLCDMODEbits __asm__ ("GLCDMODE") __attribute__((section("sfrs"), address(0xBF8EA000)));
#define GLCDCLKCON GLCDCLKCON
extern volatile uint32_t   GLCDCLKCON __attribute__((section("sfrs"), address(0xBF8EA004)));
typedef struct {
  uint32_t CLKDIV:6;
  uint32_t :2;
  uint32_t LPREFETCH:6;
} __GLCDCLKCONbits_t;
extern volatile __GLCDCLKCONbits_t GLCDCLKCONbits __asm__ ("GLCDCLKCON") __attribute__((section("sfrs"), address(0xBF8EA004)));
#define GLCDBGCOLOR GLCDBGCOLOR
extern volatile uint32_t   GLCDBGCOLOR __attribute__((section("sfrs"), address(0xBF8EA008)));
typedef struct {
  uint32_t ALPHA:8;
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDBGCOLORbits_t;
extern volatile __GLCDBGCOLORbits_t GLCDBGCOLORbits __asm__ ("GLCDBGCOLOR") __attribute__((section("sfrs"), address(0xBF8EA008)));
#define GLCDRES GLCDRES
extern volatile uint32_t   GLCDRES __attribute__((section("sfrs"), address(0xBF8EA00C)));
typedef struct {
  uint32_t RESY:11;
  uint32_t :5;
  uint32_t RESX:11;
} __GLCDRESbits_t;
extern volatile __GLCDRESbits_t GLCDRESbits __asm__ ("GLCDRES") __attribute__((section("sfrs"), address(0xBF8EA00C)));
#define GLCDFPORCH GLCDFPORCH
extern volatile uint32_t   GLCDFPORCH __attribute__((section("sfrs"), address(0xBF8EA014)));
typedef struct {
  uint32_t FPORCHY:11;
  uint32_t :5;
  uint32_t FPORCHX:11;
} __GLCDFPORCHbits_t;
extern volatile __GLCDFPORCHbits_t GLCDFPORCHbits __asm__ ("GLCDFPORCH") __attribute__((section("sfrs"), address(0xBF8EA014)));
#define GLCDBLANKING GLCDBLANKING
extern volatile uint32_t   GLCDBLANKING __attribute__((section("sfrs"), address(0xBF8EA018)));
typedef struct {
  uint32_t BLANKINGY:11;
  uint32_t :5;
  uint32_t BLANKINGX:11;
} __GLCDBLANKINGbits_t;
extern volatile __GLCDBLANKINGbits_t GLCDBLANKINGbits __asm__ ("GLCDBLANKING") __attribute__((section("sfrs"), address(0xBF8EA018)));
#define GLCDBPORCH GLCDBPORCH
extern volatile uint32_t   GLCDBPORCH __attribute__((section("sfrs"), address(0xBF8EA01C)));
typedef struct {
  uint32_t BPORCHY:11;
  uint32_t :5;
  uint32_t BPORCHX:11;
} __GLCDBPORCHbits_t;
extern volatile __GLCDBPORCHbits_t GLCDBPORCHbits __asm__ ("GLCDBPORCH") __attribute__((section("sfrs"), address(0xBF8EA01C)));
#define GLCDCURSOR GLCDCURSOR
extern volatile uint32_t   GLCDCURSOR __attribute__((section("sfrs"), address(0xBF8EA020)));
typedef struct {
  uint32_t CURSORY:11;
  uint32_t :5;
  uint32_t CURSORX:11;
} __GLCDCURSORbits_t;
extern volatile __GLCDCURSORbits_t GLCDCURSORbits __asm__ ("GLCDCURSOR") __attribute__((section("sfrs"), address(0xBF8EA020)));
#define GLCDL0MODE GLCDL0MODE
extern volatile uint32_t   GLCDL0MODE __attribute__((section("sfrs"), address(0xBF8EA030)));
typedef struct {
  uint32_t COLORMODE:4;
  uint32_t :4;
  uint32_t SRCBLEND:4;
  uint32_t DESTBLEND:4;
  uint32_t ALPHA:8;
  uint32_t :4;
  uint32_t MULALPHA:1;
  uint32_t FORCEALPHA:1;
  uint32_t DISABIFIL:1;
  uint32_t LAYEREN:1;
} __GLCDL0MODEbits_t;
