Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz1064dal169.h
extern volatile __SBT7ECLRSbits_t SBT7ECLRSbits __asm__ ("SBT7ECLRS") __attribute__((section("sfrs"), address(0xBF908430)));
#define SBT7ECLRM SBT7ECLRM
extern volatile uint32_t   SBT7ECLRM __attribute__((section("sfrs"), address(0xBF908438)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT7ECLRMbits_t;
extern volatile __SBT7ECLRMbits_t SBT7ECLRMbits __asm__ ("SBT7ECLRM") __attribute__((section("sfrs"), address(0xBF908438)));
#define SBT7REG0 SBT7REG0
extern volatile uint32_t   SBT7REG0 __attribute__((section("sfrs"), address(0xBF908440)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT7REG0bits_t;
extern volatile __SBT7REG0bits_t SBT7REG0bits __asm__ ("SBT7REG0") __attribute__((section("sfrs"), address(0xBF908440)));
#define SBT7RD0 SBT7RD0
extern volatile uint32_t   SBT7RD0 __attribute__((section("sfrs"), address(0xBF908450)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT7RD0bits_t;
extern volatile __SBT7RD0bits_t SBT7RD0bits __asm__ ("SBT7RD0") __attribute__((section("sfrs"), address(0xBF908450)));
#define SBT7WR0 SBT7WR0
extern volatile uint32_t   SBT7WR0 __attribute__((section("sfrs"), address(0xBF908458)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT7WR0bits_t;
extern volatile __SBT7WR0bits_t SBT7WR0bits __asm__ ("SBT7WR0") __attribute__((section("sfrs"), address(0xBF908458)));
#define SBT7REG1 SBT7REG1
extern volatile uint32_t   SBT7REG1 __attribute__((section("sfrs"), address(0xBF908460)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT7REG1bits_t;
extern volatile __SBT7REG1bits_t SBT7REG1bits __asm__ ("SBT7REG1") __attribute__((section("sfrs"), address(0xBF908460)));
#define SBT7RD1 SBT7RD1
extern volatile uint32_t   SBT7RD1 __attribute__((section("sfrs"), address(0xBF908470)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT7RD1bits_t;
extern volatile __SBT7RD1bits_t SBT7RD1bits __asm__ ("SBT7RD1") __attribute__((section("sfrs"), address(0xBF908470)));
#define SBT7WR1 SBT7WR1
extern volatile uint32_t   SBT7WR1 __attribute__((section("sfrs"), address(0xBF908478)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT7WR1bits_t;
extern volatile __SBT7WR1bits_t SBT7WR1bits __asm__ ("SBT7WR1") __attribute__((section("sfrs"), address(0xBF908478)));
#define SBT7REG2 SBT7REG2
extern volatile uint32_t   SBT7REG2 __attribute__((section("sfrs"), address(0xBF908480)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT7REG2bits_t;
extern volatile __SBT7REG2bits_t SBT7REG2bits __asm__ ("SBT7REG2") __attribute__((section("sfrs"), address(0xBF908480)));
#define SBT7RD2 SBT7RD2
extern volatile uint32_t   SBT7RD2 __attribute__((section("sfrs"), address(0xBF908490)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT7RD2bits_t;
extern volatile __SBT7RD2bits_t SBT7RD2bits __asm__ ("SBT7RD2") __attribute__((section("sfrs"), address(0xBF908490)));
#define SBT7WR2 SBT7WR2
extern volatile uint32_t   SBT7WR2 __attribute__((section("sfrs"), address(0xBF908498)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT7WR2bits_t;
extern volatile __SBT7WR2bits_t SBT7WR2bits __asm__ ("SBT7WR2") __attribute__((section("sfrs"), address(0xBF908498)));
#define SBT8ELOG1 SBT8ELOG1
extern volatile uint32_t   SBT8ELOG1 __attribute__((section("sfrs"), address(0xBF908820)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT8ELOG1bits_t;
extern volatile __SBT8ELOG1bits_t SBT8ELOG1bits __asm__ ("SBT8ELOG1") __attribute__((section("sfrs"), address(0xBF908820)));
#define SBT8ELOG2 SBT8ELOG2
extern volatile uint32_t   SBT8ELOG2 __attribute__((section("sfrs"), address(0xBF908824)));
typedef struct {
  uint32_t GROUP:2;
} __SBT8ELOG2bits_t;
extern volatile __SBT8ELOG2bits_t SBT8ELOG2bits __asm__ ("SBT8ELOG2") __attribute__((section("sfrs"), address(0xBF908824)));
#define SBT8ECON SBT8ECON
extern volatile uint32_t   SBT8ECON __attribute__((section("sfrs"), address(0xBF908828)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT8ECONbits_t;
extern volatile __SBT8ECONbits_t SBT8ECONbits __asm__ ("SBT8ECON") __attribute__((section("sfrs"), address(0xBF908828)));
#define SBT8ECLRS SBT8ECLRS
extern volatile uint32_t   SBT8ECLRS __attribute__((section("sfrs"), address(0xBF908830)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT8ECLRSbits_t;
extern volatile __SBT8ECLRSbits_t SBT8ECLRSbits __asm__ ("SBT8ECLRS") __attribute__((section("sfrs"), address(0xBF908830)));
#define SBT8ECLRM SBT8ECLRM
extern volatile uint32_t   SBT8ECLRM __attribute__((section("sfrs"), address(0xBF908838)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT8ECLRMbits_t;
extern volatile __SBT8ECLRMbits_t SBT8ECLRMbits __asm__ ("SBT8ECLRM") __attribute__((section("sfrs"), address(0xBF908838)));
#define SBT8REG0 SBT8REG0
extern volatile uint32_t   SBT8REG0 __attribute__((section("sfrs"), address(0xBF908840)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT8REG0bits_t;
extern volatile __SBT8REG0bits_t SBT8REG0bits __asm__ ("SBT8REG0") __attribute__((section("sfrs"), address(0xBF908840)));
#define SBT8RD0 SBT8RD0
extern volatile uint32_t   SBT8RD0 __attribute__((section("sfrs"), address(0xBF908850)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT8RD0bits_t;
extern volatile __SBT8RD0bits_t SBT8RD0bits __asm__ ("SBT8RD0") __attribute__((section("sfrs"), address(0xBF908850)));
#define SBT8WR0 SBT8WR0
extern volatile uint32_t   SBT8WR0 __attribute__((section("sfrs"), address(0xBF908858)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT8WR0bits_t;
extern volatile __SBT8WR0bits_t SBT8WR0bits __asm__ ("SBT8WR0") __attribute__((section("sfrs"), address(0xBF908858)));
#define SBT8REG1 SBT8REG1
extern volatile uint32_t   SBT8REG1 __attribute__((section("sfrs"), address(0xBF908880)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT8REG1bits_t;
