Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz1064dal169.h
extern volatile __ABF1DEVCFG3bits_t ABF1DEVCFG3bits __asm__ ("ABF1DEVCFG3") __attribute__((section("sfrs"), address(0xBFC4FF40)));
#define ABF1DEVCFG2 ABF1DEVCFG2
extern volatile uint32_t   ABF1DEVCFG2 __attribute__((section("sfrs"), address(0xBFC4FF44)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLRNG:3;
    uint32_t FPLLICLK:1;
    uint32_t FPLLMULT:7;
    uint32_t :1;
    uint32_t FPLLODIV:3;
    uint32_t VBATBOREN:1;
    uint32_t DSBOREN:1;
    uint32_t DSWDTPS:5;
    uint32_t DSWDTOSC:1;
    uint32_t DSWDTEN:1;
    uint32_t FDSEN:1;
    uint32_t :1;
    uint32_t UPLLFSEL:1;
  };
  struct {
    uint32_t w:32;
  };
} __ABF1DEVCFG2bits_t;
extern volatile __ABF1DEVCFG2bits_t ABF1DEVCFG2bits __asm__ ("ABF1DEVCFG2") __attribute__((section("sfrs"), address(0xBFC4FF44)));
#define ABF1DEVCFG1 ABF1DEVCFG1
extern volatile uint32_t   ABF1DEVCFG1 __attribute__((section("sfrs"), address(0xBFC4FF48)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __ABF1DEVCFG1bits_t;
extern volatile __ABF1DEVCFG1bits_t ABF1DEVCFG1bits __asm__ ("ABF1DEVCFG1") __attribute__((section("sfrs"), address(0xBFC4FF48)));
#define ABF1DEVCFG0 ABF1DEVCFG0
extern volatile uint32_t   ABF1DEVCFG0 __attribute__((section("sfrs"), address(0xBFC4FF4C)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t POSCFGAIN:2;
    uint32_t POSCTYPE:2;
    uint32_t POSCAGCRNG:1;
    uint32_t POSCAGC:1;
    uint32_t :2;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t :24;
    uint32_t POSCAGCDLY:2;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __ABF1DEVCFG0bits_t;
extern volatile __ABF1DEVCFG0bits_t ABF1DEVCFG0bits __asm__ ("ABF1DEVCFG0") __attribute__((section("sfrs"), address(0xBFC4FF4C)));
#define ABF1DEVCP3 ABF1DEVCP3
extern volatile uint32_t   ABF1DEVCP3 __attribute__((section("sfrs"), address(0xBFC4FF50)));
#define ABF1DEVCP2 ABF1DEVCP2
extern volatile uint32_t   ABF1DEVCP2 __attribute__((section("sfrs"), address(0xBFC4FF54)));
#define ABF1DEVCP1 ABF1DEVCP1
extern volatile uint32_t   ABF1DEVCP1 __attribute__((section("sfrs"), address(0xBFC4FF58)));
#define ABF1DEVCP0 ABF1DEVCP0
extern volatile uint32_t   ABF1DEVCP0 __attribute__((section("sfrs"), address(0xBFC4FF5C)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __ABF1DEVCP0bits_t;
extern volatile __ABF1DEVCP0bits_t ABF1DEVCP0bits __asm__ ("ABF1DEVCP0") __attribute__((section("sfrs"), address(0xBFC4FF5C)));
#define ABF1DEVSIGN3 ABF1DEVSIGN3
extern volatile uint32_t   ABF1DEVSIGN3 __attribute__((section("sfrs"), address(0xBFC4FF60)));
#define ABF1DEVSIGN2 ABF1DEVSIGN2
extern volatile uint32_t   ABF1DEVSIGN2 __attribute__((section("sfrs"), address(0xBFC4FF64)));
#define ABF1DEVSIGN1 ABF1DEVSIGN1
extern volatile uint32_t   ABF1DEVSIGN1 __attribute__((section("sfrs"), address(0xBFC4FF68)));
#define ABF1DEVSIGN0 ABF1DEVSIGN0
extern volatile uint32_t   ABF1DEVSIGN0 __attribute__((section("sfrs"), address(0xBFC4FF6C)));
#define ABF1SEQ3 ABF1SEQ3
extern volatile uint32_t   ABF1SEQ3 __attribute__((section("sfrs"), address(0xBFC4FF70)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __ABF1SEQ3bits_t;
extern volatile __ABF1SEQ3bits_t ABF1SEQ3bits __asm__ ("ABF1SEQ3") __attribute__((section("sfrs"), address(0xBFC4FF70)));
#define ABF1SEQ2 ABF1SEQ2
extern volatile uint32_t   ABF1SEQ2 __attribute__((section("sfrs"), address(0xBFC4FF74)));
#define ABF1SEQ1 ABF1SEQ1
extern volatile uint32_t   ABF1SEQ1 __attribute__((section("sfrs"), address(0xBFC4FF78)));
#define ABF1SEQ0 ABF1SEQ0
extern volatile uint32_t   ABF1SEQ0 __attribute__((section("sfrs"), address(0xBFC4FF7C)));
#define BF1DEVCFG4 BF1DEVCFG4
extern volatile uint32_t   BF1DEVCFG4 __attribute__((section("sfrs"), address(0xBFC4FFBC)));
typedef union {
  struct {
    uint32_t :24;
    uint32_t SWDTPS:5;
  };
  struct {
    uint32_t w:32;
  };
} __BF1DEVCFG4bits_t;
extern volatile __BF1DEVCFG4bits_t BF1DEVCFG4bits __asm__ ("BF1DEVCFG4") __attribute__((section("sfrs"), address(0xBFC4FFBC)));
#define BF1DEVCFG3 BF1DEVCFG3
extern volatile uint32_t   BF1DEVCFG3 __attribute__((section("sfrs"), address(0xBFC4FFC0)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t :8;
    uint32_t FMIIEN:1;
    uint32_t FETHIO:1;
    uint32_t :1;
    uint32_t PGL1WAY:1;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
  };
  struct {
    uint32_t w:32;
  };
} __BF1DEVCFG3bits_t;
extern volatile __BF1DEVCFG3bits_t BF1DEVCFG3bits __asm__ ("BF1DEVCFG3") __attribute__((section("sfrs"), address(0xBFC4FFC0)));
#define BF1DEVCFG2 BF1DEVCFG2
extern volatile uint32_t   BF1DEVCFG2 __attribute__((section("sfrs"), address(0xBFC4FFC4)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLRNG:3;
    uint32_t FPLLICLK:1;
    uint32_t FPLLMULT:7;
    uint32_t :1;
    uint32_t FPLLODIV:3;
    uint32_t VBATBOREN:1;
    uint32_t DSBOREN:1;
    uint32_t DSWDTPS:5;
    uint32_t DSWDTOSC:1;
    uint32_t DSWDTEN:1;
    uint32_t FDSEN:1;
    uint32_t :1;
    uint32_t UPLLFSEL:1;
  };
  struct {
    uint32_t w:32;
  };
} __BF1DEVCFG2bits_t;
extern volatile __BF1DEVCFG2bits_t BF1DEVCFG2bits __asm__ ("BF1DEVCFG2") __attribute__((section("sfrs"), address(0xBFC4FFC4)));
#define BF1DEVCFG1 BF1DEVCFG1
extern volatile uint32_t   BF1DEVCFG1 __attribute__((section("sfrs"), address(0xBFC4FFC8)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __BF1DEVCFG1bits_t;
