Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz1064dal169.h
#define _IFS2_ADCD32IF_POSITION                  0x0000001B
#define _IFS2_ADCD32IF_MASK                      0x08000000
#define _IFS2_ADCD32IF_LENGTH                    0x00000001

#define _IFS2_ADCD33IF_POSITION                  0x0000001C
#define _IFS2_ADCD33IF_MASK                      0x10000000
#define _IFS2_ADCD33IF_LENGTH                    0x00000001

#define _IFS2_ADCD34IF_POSITION                  0x0000001D
#define _IFS2_ADCD34IF_MASK                      0x20000000
#define _IFS2_ADCD34IF_LENGTH                    0x00000001

#define _IFS2_ADCD35IF_POSITION                  0x0000001E
#define _IFS2_ADCD35IF_MASK                      0x40000000
#define _IFS2_ADCD35IF_LENGTH                    0x00000001

#define _IFS2_ADCD36IF_POSITION                  0x0000001F
#define _IFS2_ADCD36IF_MASK                      0x80000000
#define _IFS2_ADCD36IF_LENGTH                    0x00000001

#define _IFS2_w_POSITION                         0x00000000
#define _IFS2_w_MASK                             0xFFFFFFFF
#define _IFS2_w_LENGTH                           0x00000020

#define _IFS3_ADCD37IF_POSITION                  0x00000000
#define _IFS3_ADCD37IF_MASK                      0x00000001
#define _IFS3_ADCD37IF_LENGTH                    0x00000001

#define _IFS3_ADCD38IF_POSITION                  0x00000001
#define _IFS3_ADCD38IF_MASK                      0x00000002
#define _IFS3_ADCD38IF_LENGTH                    0x00000001

#define _IFS3_ADCD39IF_POSITION                  0x00000002
#define _IFS3_ADCD39IF_MASK                      0x00000004
#define _IFS3_ADCD39IF_LENGTH                    0x00000001

#define _IFS3_ADCD40IF_POSITION                  0x00000003
#define _IFS3_ADCD40IF_MASK                      0x00000008
#define _IFS3_ADCD40IF_LENGTH                    0x00000001

#define _IFS3_ADCD41IF_POSITION                  0x00000004
#define _IFS3_ADCD41IF_MASK                      0x00000010
#define _IFS3_ADCD41IF_LENGTH                    0x00000001

#define _IFS3_ADCD42IF_POSITION                  0x00000005
#define _IFS3_ADCD42IF_MASK                      0x00000020
#define _IFS3_ADCD42IF_LENGTH                    0x00000001

#define _IFS3_ADCD43IF_POSITION                  0x00000006
#define _IFS3_ADCD43IF_MASK                      0x00000040
#define _IFS3_ADCD43IF_LENGTH                    0x00000001

#define _IFS3_USBSRIF_POSITION                   0x00000007
#define _IFS3_USBSRIF_MASK                       0x00000080
#define _IFS3_USBSRIF_LENGTH                     0x00000001

#define _IFS3_CPCIF_POSITION                     0x00000008
#define _IFS3_CPCIF_MASK                         0x00000100
#define _IFS3_CPCIF_LENGTH                       0x00000001

#define _IFS3_CFDCIF_POSITION                    0x00000009
#define _IFS3_CFDCIF_MASK                        0x00000200
#define _IFS3_CFDCIF_LENGTH                      0x00000001

#define _IFS3_SBIF_POSITION                      0x0000000A
#define _IFS3_SBIF_MASK                          0x00000400
#define _IFS3_SBIF_LENGTH                        0x00000001

#define _IFS3_CRPTIF_POSITION                    0x0000000B
#define _IFS3_CRPTIF_MASK                        0x00000800
#define _IFS3_CRPTIF_LENGTH                      0x00000001

#define _IFS3_SPI1EIF_POSITION                   0x0000000D
#define _IFS3_SPI1EIF_MASK                       0x00002000
#define _IFS3_SPI1EIF_LENGTH                     0x00000001

#define _IFS3_SPI1RXIF_POSITION                  0x0000000E
#define _IFS3_SPI1RXIF_MASK                      0x00004000
#define _IFS3_SPI1RXIF_LENGTH                    0x00000001

#define _IFS3_SPI1TXIF_POSITION                  0x0000000F
#define _IFS3_SPI1TXIF_MASK                      0x00008000
#define _IFS3_SPI1TXIF_LENGTH                    0x00000001

#define _IFS3_U1EIF_POSITION                     0x00000010
#define _IFS3_U1EIF_MASK                         0x00010000
#define _IFS3_U1EIF_LENGTH                       0x00000001

#define _IFS3_U1RXIF_POSITION                    0x00000011
#define _IFS3_U1RXIF_MASK                        0x00020000
#define _IFS3_U1RXIF_LENGTH                      0x00000001

#define _IFS3_U1TXIF_POSITION                    0x00000012
#define _IFS3_U1TXIF_MASK                        0x00040000
#define _IFS3_U1TXIF_LENGTH                      0x00000001

#define _IFS3_I2C1BIF_POSITION                   0x00000013
#define _IFS3_I2C1BIF_MASK                       0x00080000
#define _IFS3_I2C1BIF_LENGTH                     0x00000001

#define _IFS3_I2C1SIF_POSITION                   0x00000014
#define _IFS3_I2C1SIF_MASK                       0x00100000
#define _IFS3_I2C1SIF_LENGTH                     0x00000001

#define _IFS3_I2C1MIF_POSITION                   0x00000015
#define _IFS3_I2C1MIF_MASK                       0x00200000
#define _IFS3_I2C1MIF_LENGTH                     0x00000001

#define _IFS3_CNAIF_POSITION                     0x00000016
#define _IFS3_CNAIF_MASK                         0x00400000
#define _IFS3_CNAIF_LENGTH                       0x00000001

#define _IFS3_CNBIF_POSITION                     0x00000017
#define _IFS3_CNBIF_MASK                         0x00800000
#define _IFS3_CNBIF_LENGTH                       0x00000001

#define _IFS3_CNCIF_POSITION                     0x00000018
#define _IFS3_CNCIF_MASK                         0x01000000
#define _IFS3_CNCIF_LENGTH                       0x00000001

#define _IFS3_CNDIF_POSITION                     0x00000019
#define _IFS3_CNDIF_MASK                         0x02000000
#define _IFS3_CNDIF_LENGTH                       0x00000001

#define _IFS3_CNEIF_POSITION                     0x0000001A
#define _IFS3_CNEIF_MASK                         0x04000000
#define _IFS3_CNEIF_LENGTH                       0x00000001

#define _IFS3_CNFIF_POSITION                     0x0000001B
#define _IFS3_CNFIF_MASK                         0x08000000
#define _IFS3_CNFIF_LENGTH                       0x00000001

#define _IFS3_CNGIF_POSITION                     0x0000001C
#define _IFS3_CNGIF_MASK                         0x10000000
#define _IFS3_CNGIF_LENGTH                       0x00000001

#define _IFS3_CNHIF_POSITION                     0x0000001D
#define _IFS3_CNHIF_MASK                         0x20000000
#define _IFS3_CNHIF_LENGTH                       0x00000001

#define _IFS3_CNJIF_POSITION                     0x0000001E
#define _IFS3_CNJIF_MASK                         0x40000000
#define _IFS3_CNJIF_LENGTH                       0x00000001

#define _IFS3_CNKIF_POSITION                     0x0000001F
#define _IFS3_CNKIF_MASK                         0x80000000
#define _IFS3_CNKIF_LENGTH                       0x00000001

#define _IFS3_w_POSITION                         0x00000000
#define _IFS3_w_MASK                             0xFFFFFFFF
#define _IFS3_w_LENGTH                           0x00000020

