Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz1064dal169.h
#define _GLCDCLUT3_GREEN_POSITION                0x00000008
#define _GLCDCLUT3_GREEN_MASK                    0x0000FF00
#define _GLCDCLUT3_GREEN_LENGTH                  0x00000008

#define _GLCDCLUT3_RED_POSITION                  0x00000010
#define _GLCDCLUT3_RED_MASK                      0x00FF0000
#define _GLCDCLUT3_RED_LENGTH                    0x00000008

#define _GLCDCLUT4_BLUE_POSITION                 0x00000000
#define _GLCDCLUT4_BLUE_MASK                     0x000000FF
#define _GLCDCLUT4_BLUE_LENGTH                   0x00000008

#define _GLCDCLUT4_GREEN_POSITION                0x00000008
#define _GLCDCLUT4_GREEN_MASK                    0x0000FF00
#define _GLCDCLUT4_GREEN_LENGTH                  0x00000008

#define _GLCDCLUT4_RED_POSITION                  0x00000010
#define _GLCDCLUT4_RED_MASK                      0x00FF0000
#define _GLCDCLUT4_RED_LENGTH                    0x00000008

#define _GLCDCLUT5_BLUE_POSITION                 0x00000000
#define _GLCDCLUT5_BLUE_MASK                     0x000000FF
#define _GLCDCLUT5_BLUE_LENGTH                   0x00000008

#define _GLCDCLUT5_GREEN_POSITION                0x00000008
#define _GLCDCLUT5_GREEN_MASK                    0x0000FF00
#define _GLCDCLUT5_GREEN_LENGTH                  0x00000008

#define _GLCDCLUT5_RED_POSITION                  0x00000010
#define _GLCDCLUT5_RED_MASK                      0x00FF0000
#define _GLCDCLUT5_RED_LENGTH                    0x00000008

#define _GLCDCLUT6_BLUE_POSITION                 0x00000000
#define _GLCDCLUT6_BLUE_MASK                     0x000000FF
#define _GLCDCLUT6_BLUE_LENGTH                   0x00000008

#define _GLCDCLUT6_GREEN_POSITION                0x00000008
#define _GLCDCLUT6_GREEN_MASK                    0x0000FF00
#define _GLCDCLUT6_GREEN_LENGTH                  0x00000008

#define _GLCDCLUT6_RED_POSITION                  0x00000010
#define _GLCDCLUT6_RED_MASK                      0x00FF0000
#define _GLCDCLUT6_RED_LENGTH                    0x00000008

#define _GLCDCLUT7_BLUE_POSITION                 0x00000000
#define _GLCDCLUT7_BLUE_MASK                     0x000000FF
#define _GLCDCLUT7_BLUE_LENGTH                   0x00000008

#define _GLCDCLUT7_GREEN_POSITION                0x00000008
#define _GLCDCLUT7_GREEN_MASK                    0x0000FF00
#define _GLCDCLUT7_GREEN_LENGTH                  0x00000008

#define _GLCDCLUT7_RED_POSITION                  0x00000010
#define _GLCDCLUT7_RED_MASK                      0x00FF0000
#define _GLCDCLUT7_RED_LENGTH                    0x00000008

#define _GLCDCLUT8_BLUE_POSITION                 0x00000000
#define _GLCDCLUT8_BLUE_MASK                     0x000000FF
#define _GLCDCLUT8_BLUE_LENGTH                   0x00000008

#define _GLCDCLUT8_GREEN_POSITION                0x00000008
#define _GLCDCLUT8_GREEN_MASK                    0x0000FF00
#define _GLCDCLUT8_GREEN_LENGTH                  0x00000008

#define _GLCDCLUT8_RED_POSITION                  0x00000010
#define _GLCDCLUT8_RED_MASK                      0x00FF0000
#define _GLCDCLUT8_RED_LENGTH                    0x00000008

#define _GLCDCLUT9_BLUE_POSITION                 0x00000000
#define _GLCDCLUT9_BLUE_MASK                     0x000000FF
#define _GLCDCLUT9_BLUE_LENGTH                   0x00000008

#define _GLCDCLUT9_GREEN_POSITION                0x00000008
#define _GLCDCLUT9_GREEN_MASK                    0x0000FF00
#define _GLCDCLUT9_GREEN_LENGTH                  0x00000008

#define _GLCDCLUT9_RED_POSITION                  0x00000010
#define _GLCDCLUT9_RED_MASK                      0x00FF0000
#define _GLCDCLUT9_RED_LENGTH                    0x00000008

#define _GLCDCLUT10_BLUE_POSITION                0x00000000
#define _GLCDCLUT10_BLUE_MASK                    0x000000FF
#define _GLCDCLUT10_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT10_GREEN_POSITION               0x00000008
#define _GLCDCLUT10_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT10_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT10_RED_POSITION                 0x00000010
#define _GLCDCLUT10_RED_MASK                     0x00FF0000
#define _GLCDCLUT10_RED_LENGTH                   0x00000008

#define _GLCDCLUT11_BLUE_POSITION                0x00000000
#define _GLCDCLUT11_BLUE_MASK                    0x000000FF
#define _GLCDCLUT11_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT11_GREEN_POSITION               0x00000008
#define _GLCDCLUT11_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT11_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT11_RED_POSITION                 0x00000010
#define _GLCDCLUT11_RED_MASK                     0x00FF0000
#define _GLCDCLUT11_RED_LENGTH                   0x00000008

#define _GLCDCLUT12_BLUE_POSITION                0x00000000
#define _GLCDCLUT12_BLUE_MASK                    0x000000FF
#define _GLCDCLUT12_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT12_GREEN_POSITION               0x00000008
#define _GLCDCLUT12_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT12_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT12_RED_POSITION                 0x00000010
#define _GLCDCLUT12_RED_MASK                     0x00FF0000
#define _GLCDCLUT12_RED_LENGTH                   0x00000008

#define _GLCDCLUT13_BLUE_POSITION                0x00000000
#define _GLCDCLUT13_BLUE_MASK                    0x000000FF
#define _GLCDCLUT13_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT13_GREEN_POSITION               0x00000008
#define _GLCDCLUT13_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT13_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT13_RED_POSITION                 0x00000010
#define _GLCDCLUT13_RED_MASK                     0x00FF0000
#define _GLCDCLUT13_RED_LENGTH                   0x00000008

#define _GLCDCLUT14_BLUE_POSITION                0x00000000
#define _GLCDCLUT14_BLUE_MASK                    0x000000FF
#define _GLCDCLUT14_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT14_GREEN_POSITION               0x00000008
#define _GLCDCLUT14_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT14_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT14_RED_POSITION                 0x00000010
#define _GLCDCLUT14_RED_MASK                     0x00FF0000
#define _GLCDCLUT14_RED_LENGTH                   0x00000008

#define _GLCDCLUT15_BLUE_POSITION                0x00000000
#define _GLCDCLUT15_BLUE_MASK                    0x000000FF
#define _GLCDCLUT15_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT15_GREEN_POSITION               0x00000008
#define _GLCDCLUT15_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT15_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT15_RED_POSITION                 0x00000010
#define _GLCDCLUT15_RED_MASK                     0x00FF0000
#define _GLCDCLUT15_RED_LENGTH                   0x00000008

#define _GLCDCLUT16_BLUE_POSITION                0x00000000
#define _GLCDCLUT16_BLUE_MASK                    0x000000FF
#define _GLCDCLUT16_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT16_GREEN_POSITION               0x00000008
#define _GLCDCLUT16_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT16_GREEN_LENGTH                 0x00000008

