Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz1064dal169.h
#define _GLCDCURDATA40_PIXEL102_POSITION         0x00000014
#define _GLCDCURDATA40_PIXEL102_MASK             0x00F00000
#define _GLCDCURDATA40_PIXEL102_LENGTH           0x00000004

#define _GLCDCURDATA40_PIXEL101_POSITION         0x00000018
#define _GLCDCURDATA40_PIXEL101_MASK             0x0F000000
#define _GLCDCURDATA40_PIXEL101_LENGTH           0x00000004

#define _GLCDCURDATA40_PIXEL100_POSITION         0x0000001C
#define _GLCDCURDATA40_PIXEL100_MASK             0xF0000000
#define _GLCDCURDATA40_PIXEL100_LENGTH           0x00000004

#define _GLCDCURDATA41_PIXEL1015_POSITION        0x00000000
#define _GLCDCURDATA41_PIXEL1015_MASK            0x0000000F
#define _GLCDCURDATA41_PIXEL1015_LENGTH          0x00000004

#define _GLCDCURDATA41_PIXEL1014_POSITION        0x00000004
#define _GLCDCURDATA41_PIXEL1014_MASK            0x000000F0
#define _GLCDCURDATA41_PIXEL1014_LENGTH          0x00000004

#define _GLCDCURDATA41_PIXEL1013_POSITION        0x00000008
#define _GLCDCURDATA41_PIXEL1013_MASK            0x00000F00
#define _GLCDCURDATA41_PIXEL1013_LENGTH          0x00000004

#define _GLCDCURDATA41_PIXEL1012_POSITION        0x0000000C
#define _GLCDCURDATA41_PIXEL1012_MASK            0x0000F000
#define _GLCDCURDATA41_PIXEL1012_LENGTH          0x00000004

#define _GLCDCURDATA41_PIXEL1011_POSITION        0x00000010
#define _GLCDCURDATA41_PIXEL1011_MASK            0x000F0000
#define _GLCDCURDATA41_PIXEL1011_LENGTH          0x00000004

#define _GLCDCURDATA41_PIXEL1010_POSITION        0x00000014
#define _GLCDCURDATA41_PIXEL1010_MASK            0x00F00000
#define _GLCDCURDATA41_PIXEL1010_LENGTH          0x00000004

#define _GLCDCURDATA41_PIXEL109_POSITION         0x00000018
#define _GLCDCURDATA41_PIXEL109_MASK             0x0F000000
#define _GLCDCURDATA41_PIXEL109_LENGTH           0x00000004

#define _GLCDCURDATA41_PIXEL108_POSITION         0x0000001C
#define _GLCDCURDATA41_PIXEL108_MASK             0xF0000000
#define _GLCDCURDATA41_PIXEL108_LENGTH           0x00000004

#define _GLCDCURDATA42_PIXEL1023_POSITION        0x00000000
#define _GLCDCURDATA42_PIXEL1023_MASK            0x0000000F
#define _GLCDCURDATA42_PIXEL1023_LENGTH          0x00000004

#define _GLCDCURDATA42_PIXEL1022_POSITION        0x00000004
#define _GLCDCURDATA42_PIXEL1022_MASK            0x000000F0
#define _GLCDCURDATA42_PIXEL1022_LENGTH          0x00000004

#define _GLCDCURDATA42_PIXEL1021_POSITION        0x00000008
#define _GLCDCURDATA42_PIXEL1021_MASK            0x00000F00
#define _GLCDCURDATA42_PIXEL1021_LENGTH          0x00000004

#define _GLCDCURDATA42_PIXEL1020_POSITION        0x0000000C
#define _GLCDCURDATA42_PIXEL1020_MASK            0x0000F000
#define _GLCDCURDATA42_PIXEL1020_LENGTH          0x00000004

#define _GLCDCURDATA42_PIXEL1019_POSITION        0x00000010
#define _GLCDCURDATA42_PIXEL1019_MASK            0x000F0000
#define _GLCDCURDATA42_PIXEL1019_LENGTH          0x00000004

#define _GLCDCURDATA42_PIXEL1018_POSITION        0x00000014
#define _GLCDCURDATA42_PIXEL1018_MASK            0x00F00000
#define _GLCDCURDATA42_PIXEL1018_LENGTH          0x00000004

#define _GLCDCURDATA42_PIXEL1017_POSITION        0x00000018
#define _GLCDCURDATA42_PIXEL1017_MASK            0x0F000000
#define _GLCDCURDATA42_PIXEL1017_LENGTH          0x00000004

#define _GLCDCURDATA42_PIXEL1016_POSITION        0x0000001C
#define _GLCDCURDATA42_PIXEL1016_MASK            0xF0000000
#define _GLCDCURDATA42_PIXEL1016_LENGTH          0x00000004

#define _GLCDCURDATA43_PIXEL1031_POSITION        0x00000000
#define _GLCDCURDATA43_PIXEL1031_MASK            0x0000000F
#define _GLCDCURDATA43_PIXEL1031_LENGTH          0x00000004

#define _GLCDCURDATA43_PIXEL1030_POSITION        0x00000004
#define _GLCDCURDATA43_PIXEL1030_MASK            0x000000F0
#define _GLCDCURDATA43_PIXEL1030_LENGTH          0x00000004

#define _GLCDCURDATA43_PIXEL1029_POSITION        0x00000008
#define _GLCDCURDATA43_PIXEL1029_MASK            0x00000F00
#define _GLCDCURDATA43_PIXEL1029_LENGTH          0x00000004

#define _GLCDCURDATA43_PIXEL1028_POSITION        0x0000000C
#define _GLCDCURDATA43_PIXEL1028_MASK            0x0000F000
#define _GLCDCURDATA43_PIXEL1028_LENGTH          0x00000004

#define _GLCDCURDATA43_PIXEL1027_POSITION        0x00000010
#define _GLCDCURDATA43_PIXEL1027_MASK            0x000F0000
#define _GLCDCURDATA43_PIXEL1027_LENGTH          0x00000004

#define _GLCDCURDATA43_PIXEL1026_POSITION        0x00000014
#define _GLCDCURDATA43_PIXEL1026_MASK            0x00F00000
#define _GLCDCURDATA43_PIXEL1026_LENGTH          0x00000004

#define _GLCDCURDATA43_PIXEL1025_POSITION        0x00000018
#define _GLCDCURDATA43_PIXEL1025_MASK            0x0F000000
#define _GLCDCURDATA43_PIXEL1025_LENGTH          0x00000004

#define _GLCDCURDATA43_PIXEL1024_POSITION        0x0000001C
#define _GLCDCURDATA43_PIXEL1024_MASK            0xF0000000
#define _GLCDCURDATA43_PIXEL1024_LENGTH          0x00000004

#define _GLCDCURDATA44_PIXEL117_POSITION         0x00000000
#define _GLCDCURDATA44_PIXEL117_MASK             0x0000000F
#define _GLCDCURDATA44_PIXEL117_LENGTH           0x00000004

#define _GLCDCURDATA44_PIXEL116_POSITION         0x00000004
#define _GLCDCURDATA44_PIXEL116_MASK             0x000000F0
#define _GLCDCURDATA44_PIXEL116_LENGTH           0x00000004

#define _GLCDCURDATA44_PIXEL115_POSITION         0x00000008
#define _GLCDCURDATA44_PIXEL115_MASK             0x00000F00
#define _GLCDCURDATA44_PIXEL115_LENGTH           0x00000004

#define _GLCDCURDATA44_PIXEL114_POSITION         0x0000000C
#define _GLCDCURDATA44_PIXEL114_MASK             0x0000F000
#define _GLCDCURDATA44_PIXEL114_LENGTH           0x00000004

#define _GLCDCURDATA44_PIXEL113_POSITION         0x00000010
#define _GLCDCURDATA44_PIXEL113_MASK             0x000F0000
#define _GLCDCURDATA44_PIXEL113_LENGTH           0x00000004

#define _GLCDCURDATA44_PIXEL112_POSITION         0x00000014
#define _GLCDCURDATA44_PIXEL112_MASK             0x00F00000
#define _GLCDCURDATA44_PIXEL112_LENGTH           0x00000004

#define _GLCDCURDATA44_PIXEL111_POSITION         0x00000018
#define _GLCDCURDATA44_PIXEL111_MASK             0x0F000000
#define _GLCDCURDATA44_PIXEL111_LENGTH           0x00000004

