Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz1064dal169.h
#define _SDHCINTSEN_CCISE_POSITION               0x00000000
#define _SDHCINTSEN_CCISE_MASK                   0x00000001
#define _SDHCINTSEN_CCISE_LENGTH                 0x00000001

#define _SDHCINTSEN_TXCISE_POSITION              0x00000001
#define _SDHCINTSEN_TXCISE_MASK                  0x00000002
#define _SDHCINTSEN_TXCISE_LENGTH                0x00000001

#define _SDHCINTSEN_BGISE_POSITION               0x00000002
#define _SDHCINTSEN_BGISE_MASK                   0x00000004
#define _SDHCINTSEN_BGISE_LENGTH                 0x00000001

#define _SDHCINTSEN_DMAISE_POSITION              0x00000003
#define _SDHCINTSEN_DMAISE_MASK                  0x00000008
#define _SDHCINTSEN_DMAISE_LENGTH                0x00000001

#define _SDHCINTSEN_BWRDYISE_POSITION            0x00000004
#define _SDHCINTSEN_BWRDYISE_MASK                0x00000010
#define _SDHCINTSEN_BWRDYISE_LENGTH              0x00000001

#define _SDHCINTSEN_BRRDYISE_POSITION            0x00000005
#define _SDHCINTSEN_BRRDYISE_MASK                0x00000020
#define _SDHCINTSEN_BRRDYISE_LENGTH              0x00000001

#define _SDHCINTSEN_CARDIISE_POSITION            0x00000006
#define _SDHCINTSEN_CARDIISE_MASK                0x00000040
#define _SDHCINTSEN_CARDIISE_LENGTH              0x00000001

#define _SDHCINTSEN_CARDRISE_POSITION            0x00000007
#define _SDHCINTSEN_CARDRISE_MASK                0x00000080
#define _SDHCINTSEN_CARDRISE_LENGTH              0x00000001

#define _SDHCINTSEN_CARDISE_POSITION             0x00000008
#define _SDHCINTSEN_CARDISE_MASK                 0x00000100
#define _SDHCINTSEN_CARDISE_LENGTH               0x00000001

#define _SDHCINTSEN_EISE_POSITION                0x0000000F
#define _SDHCINTSEN_EISE_MASK                    0x00008000
#define _SDHCINTSEN_EISE_LENGTH                  0x00000001

#define _SDHCINTSEN_CTOEISE_POSITION             0x00000010
#define _SDHCINTSEN_CTOEISE_MASK                 0x00010000
#define _SDHCINTSEN_CTOEISE_LENGTH               0x00000001

#define _SDHCINTSEN_CCRCEISE_POSITION            0x00000011
#define _SDHCINTSEN_CCRCEISE_MASK                0x00020000
#define _SDHCINTSEN_CCRCEISE_LENGTH              0x00000001

#define _SDHCINTSEN_CEBEISE_POSITION             0x00000012
#define _SDHCINTSEN_CEBEISE_MASK                 0x00040000
#define _SDHCINTSEN_CEBEISE_LENGTH               0x00000001

#define _SDHCINTSEN_CIDXEISE_POSITION            0x00000013
#define _SDHCINTSEN_CIDXEISE_MASK                0x00080000
#define _SDHCINTSEN_CIDXEISE_LENGTH              0x00000001

#define _SDHCINTSEN_DTOEISE_POSITION             0x00000014
#define _SDHCINTSEN_DTOEISE_MASK                 0x00100000
#define _SDHCINTSEN_DTOEISE_LENGTH               0x00000001

#define _SDHCINTSEN_DCRCEISE_POSITION            0x00000015
#define _SDHCINTSEN_DCRCEISE_MASK                0x00200000
#define _SDHCINTSEN_DCRCEISE_LENGTH              0x00000001

#define _SDHCINTSEN_DEBEISE_POSITION             0x00000016
#define _SDHCINTSEN_DEBEISE_MASK                 0x00400000
#define _SDHCINTSEN_DEBEISE_LENGTH               0x00000001

#define _SDHCINTSEN_CLEISE_POSITION              0x00000017
#define _SDHCINTSEN_CLEISE_MASK                  0x00800000
#define _SDHCINTSEN_CLEISE_LENGTH                0x00000001

#define _SDHCINTSEN_ACEISE_POSITION              0x00000018
#define _SDHCINTSEN_ACEISE_MASK                  0x01000000
#define _SDHCINTSEN_ACEISE_LENGTH                0x00000001

#define _SDHCINTSEN_ADEISE_POSITION              0x00000019
#define _SDHCINTSEN_ADEISE_MASK                  0x02000000
#define _SDHCINTSEN_ADEISE_LENGTH                0x00000001

#define _SDHCSTAT2_ACNEXEC_POSITION              0x00000000
#define _SDHCSTAT2_ACNEXEC_MASK                  0x00000001
#define _SDHCSTAT2_ACNEXEC_LENGTH                0x00000001

#define _SDHCSTAT2_ACTOE_POSITION                0x00000001
#define _SDHCSTAT2_ACTOE_MASK                    0x00000002
#define _SDHCSTAT2_ACTOE_LENGTH                  0x00000001

#define _SDHCSTAT2_ACCRCE_POSITION               0x00000002
#define _SDHCSTAT2_ACCRCE_MASK                   0x00000004
#define _SDHCSTAT2_ACCRCE_LENGTH                 0x00000001

#define _SDHCSTAT2_ACEBE_POSITION                0x00000003
#define _SDHCSTAT2_ACEBE_MASK                    0x00000008
#define _SDHCSTAT2_ACEBE_LENGTH                  0x00000001

#define _SDHCSTAT2_ACIDXE_POSITION               0x00000004
#define _SDHCSTAT2_ACIDXE_MASK                   0x00000010
#define _SDHCSTAT2_ACIDXE_LENGTH                 0x00000001

#define _SDHCSTAT2_CNISSE_POSITION               0x00000007
#define _SDHCSTAT2_CNISSE_MASK                   0x00000080
#define _SDHCSTAT2_CNISSE_LENGTH                 0x00000001

#define _SDHCCAP_TOCLKFREQ_POSITION              0x00000000
#define _SDHCCAP_TOCLKFREQ_MASK                  0x0000003F
#define _SDHCCAP_TOCLKFREQ_LENGTH                0x00000006

#define _SDHCCAP_TOCLKU_POSITION                 0x00000007
#define _SDHCCAP_TOCLKU_MASK                     0x00000080
#define _SDHCCAP_TOCLKU_LENGTH                   0x00000001

#define _SDHCCAP_BASECLK_POSITION                0x00000008
#define _SDHCCAP_BASECLK_MASK                    0x0000FF00
#define _SDHCCAP_BASECLK_LENGTH                  0x00000008

#define _SDHCCAP_MBLEN_POSITION                  0x00000012
#define _SDHCCAP_MBLEN_MASK                      0x000C0000
#define _SDHCCAP_MBLEN_LENGTH                    0x00000002

#define _SDHCCAP_BUS8BIT_POSITION                0x00000014
#define _SDHCCAP_BUS8BIT_MASK                    0x00100000
#define _SDHCCAP_BUS8BIT_LENGTH                  0x00000001

#define _SDHCCAP_ADMA2_POSITION                  0x00000015
#define _SDHCCAP_ADMA2_MASK                      0x00200000
#define _SDHCCAP_ADMA2_LENGTH                    0x00000001

#define _SDHCCAP_HISPEED_POSITION                0x00000017
#define _SDHCCAP_HISPEED_MASK                    0x00800000
#define _SDHCCAP_HISPEED_LENGTH                  0x00000001

#define _SDHCCAP_SRESUME_POSITION                0x00000019
#define _SDHCCAP_SRESUME_MASK                    0x02000000
#define _SDHCCAP_SRESUME_LENGTH                  0x00000001

#define _SDHCCAP_VOLT3V3_POSITION                0x0000001A
#define _SDHCCAP_VOLT3V3_MASK                    0x04000000
#define _SDHCCAP_VOLT3V3_LENGTH                  0x00000001

#define _SDHCCAP_ASYNCINT_POSITION               0x0000001F
#define _SDHCCAP_ASYNCINT_MASK                   0x80000000
#define _SDHCCAP_ASYNCINT_LENGTH                 0x00000001

#define _SDHCCAP_SLOTTYPE_POSITION               0x00000020
#define _SDHCCAP_SLOTTYPE_MASK                   0x300000000
#define _SDHCCAP_SLOTTYPE_LENGTH                 0x00000002

#define _SDHCMAXCAP_MC3V3_POSITION               0x00000000
#define _SDHCMAXCAP_MC3V3_MASK                   0x000000FF
#define _SDHCMAXCAP_MC3V3_LENGTH                 0x00000008

#define _SDHCFE_FEACNEE_POSITION                 0x00000000
#define _SDHCFE_FEACNEE_MASK                     0x00000001
#define _SDHCFE_FEACNEE_LENGTH                   0x00000001

#define _SDHCFE_FEACTOE_POSITION                 0x00000001
#define _SDHCFE_FEACTOE_MASK                     0x00000002
#define _SDHCFE_FEACTOE_LENGTH                   0x00000001

#define _SDHCFE_FEACCRCE_POSITION                0x00000002
#define _SDHCFE_FEACCRCE_MASK                    0x00000004
#define _SDHCFE_FEACCRCE_LENGTH                  0x00000001

#define _SDHCFE_FEACEBE_POSITION                 0x00000003
#define _SDHCFE_FEACEBE_MASK                     0x00000008
#define _SDHCFE_FEACEBE_LENGTH                   0x00000001

#define _SDHCFE_FEACIDXE_POSITION                0x00000004
#define _SDHCFE_FEACIDXE_MASK                    0x00000010
#define _SDHCFE_FEACIDXE_LENGTH                  0x00000001

#define _SDHCFE_FECNIACE_POSITION                0x00000007
#define _SDHCFE_FECNIACE_MASK                    0x00000080
#define _SDHCFE_FECNIACE_LENGTH                  0x00000001

#define _SDHCFE_FECTOE_POSITION                  0x00000010
#define _SDHCFE_FECTOE_MASK                      0x00010000
#define _SDHCFE_FECTOE_LENGTH                    0x00000001

#define _SDHCFE_FECCRCE_POSITION                 0x00000011
#define _SDHCFE_FECCRCE_MASK                     0x00020000
#define _SDHCFE_FECCRCE_LENGTH                   0x00000001

